configurations/emacs/README.org
#+title: My Emacs Configuration
#+property: header-args:emacs-lisp :tangle "init.el" :mkdirp yes

* Intro
This is my emacs configuration. It's a mess.
Here are the configuration i took from to build mine:
- /minimal-emacs.d/ configuration of jamescherti https://github.com/jamescherti/minimal-emacs.d
- the excellent [[https://protesilaos.com/emacs/dotemacs][config]] of Protesilaos Stavrou
- the very instructive [[https://github.com/daviwil/dotfiles/blob/master/Emacs.org][config]] of David Wilson
- the well made emacs-solo of LionyxML https://github.com/LionyxML/emacs-solo
 
* Setup
** Install emacs
Emacs can both be installed from a package manager or built from sources.
This is a quick snippet to configure the emacs sources for linux:

#+begin_src shell
  ./configure --prefix=/usr/local --with-x-toolkit=gtk3 --disable-gc-mark-trace --with-native-compilation=aot --without-gif --without-tiff --without-selinux --with-xinput2 --without-gpm --without-compress-install --without-xft --with-cairo --with-harfbuzz --with-tree-sitter=ifavailable --without-gsettings --without-gconf
#+end_src

** Tangle this org literate config
Evaluate this line before tangling the whole file to avoid being
asked if confirm every code block
#+begin_src emacs-lisp :tangle no
  (setq org-confirm-babel-evaluate nil)
#+end_src
** ways to swap CTRL and CAPS-LOCK
*** Windows

to activate run this script as a .reg file
#+begin_src
REGEDIT4

[HKEY_LOCAL_MACHINE\SYSTEM\CurrentControlSet\Control\Keyboard Layout]
"Scancode Map"=hex:00,00,00,00,00,00,00,00,03,00,00,00,1d,00,3a,00,3a,00,1d,00,00,00,00,00
#+end_src

and run that as a .reg file to deactivate it

#+begin_src 
REGEDIT4
[HKEY_LOCAL_MACHINE\SYSTEM\CurrentControlSet\Control\Keyboard Layout]
"Scancode Map"=-
#+end_src

*** Linux
On Linux, using the X Windows Server it just need to run or put it in the init
script.

#+begin_src shell
  setxkbmap -option ctrl:swapcaps
#+end_src

** Linux
*** start server at startup script
Copy this to *"~/.config/systemd/user/emacs.service"*
#+begin_src shell
  [Unit]
  Description=Emacs text editor
  Documentation=info:emacs man:emacs(1) https://gnu.org/software/emacs/

  [Service]
  Type=forking
  ExecStart=/usr/bin/emacs --daemon
  ExecStop=/usr/bin/emacsclient --eval "(kill-emacs)"
  Environment=SSH_AUTH_SOCK=%t/keyring/ssh
  Restart=on-failure

  [Install]
  WantedBy=default.target
#+end_src
and the enable the service with
#+begin_src shell
  systemctl enable --user emacs
  systemctl start --user emacs
#+end_src

** Windows
*** start server at startup script
#+begin_src shell
  # Path to startup file
  $startup_file = "$([Environment]::GetFolderPath('Startup'))\StartEmacsServer.bat"

  # Introduce variable HOME:
  # 1. for simplicity
  # 2. runemacs.exe expects it to be
  #
  # %APPDATA% is chosen because runemacs.exe operates there
  #	https://www.gnu.org/software/emacs/manual/html_node/emacs/Find-Init.html#Find-Init
  #	https://www.gnu.org/software/emacs/manual/html_node/emacs/General-Variables.html#General-Variables
  New-Item $startup_file -type file
  Set-Content -Path $startup_file -Value "set HOME=%APPDATA%"

  # Clean previous server file info first
  Add-Content -Path $startup_file -Value "del /Q ""%HOME%/.emacs.d/server/*"""
  Add-Content -Path $startup_file -Value "runemacs.exe --daemon"
#+end_src

*** install from scoop
The best way i found to install emacs on windows is via *scoop* and create a
script on *$USERPATH/Roaming/Microsoft/Windows/Start Menu/Programs/Startup* that
starts the emacs server automatically at the startup.

#+begin_src shell
  Set-ExecutionPolicy RemoteSigned -Scope CurrentUser # Optional: Needed to run a remote script the first time
  irm get.scoop.sh | iex
  scoop update *
  scoop buckets add kiennq-scoop
  scoop install emacs-k
#+end_src

*** build from source
- install msys2
- run this script
#+begin_src shell
  git clone https://github.com/emacs-mirror/emacs emacs-master  
  cd emacs-master
  mingw64-bat
  pacman -S --needed \
         base-devel \
         autoconf \
         mingw-w64-x86_64-toolchain \
         mingw-w64-x86_64-xpm-nox \
         mingw-w64-x86_64-gmp \
         mingw-w64-x86_64-gnutls \
         mingw-w64-x86_64-libtiff \
         mingw-w64-x86_64-giflib \
         mingw-w64-x86_64-libpng \
         mingw-w64-x86_64-libjpeg-turbo \
         mingw-w64-x86_64-librsvg \
         mingw-w64-x86_64-libwebp \
         mingw-w64-x86_64-lcms2 \
         mingw-w64-x86_64-jansson \
         mingw-w64-x86_64-libxml2 \
         mingw-w64-x86_64-zlib \
         mingw-w64-x86_64-harfbuzz \
         mingw-w64-x86_64-libgccjit \
         mingw-w64-x86_64-sqlite3 \
         mingw-w64-x86_64-tree-sitter
  ./autogen.sh
  ./configure --with-native-compilation=yes --with-tree-sitter --without-dbus --with-json --with-wide-int
  make
  make install
#+end_src

*** use msys2 bash in emacs shell
To use the MSYS2 bash shell in the emacs shell emulator you need to:
- place this snippet in the post-init.el and adjust the paths
  
  #+begin_src emacs-lisp :tangle nil
    (setenv "TERM" "dumb")
    (setq explicit-shell-file-name "C:/msys64/usr/bin/bash.exe")
    (setq shell-file-name "bash")
    (setq explicit-bash-args '("--login" "i"))
    (add-hook 'comint-output-filter-functions 'comint-strip-ctrl-m)
  #+end_src
- modify the .bashrc script of the MSYS2 environment to add the /usr/bin
  and /local/usr/bin folders
  
  #+begin_src bash
    export PATH="/usr/local/bin:/usr/bin:$PATH"
  #+end_src
*** find
Under windows when emacs looks for *find* command it found one, but the wrong
one. One solution is to use MSYS2's one. So go to the
<MSYS2 ROOT>/usr/bin/ and copy
msys-iconv-2.dll
msys-intl-8.dll
find.exe
to the emacs bin folder

* Configuration
** Early init
*** start of the file
#+begin_src emacs-lisp :tangle "early-init.el"
  ;; -*- lexical-binding: t -*-
#+end_src
*** garbage collector
#+begin_src emacs-lisp :tangle "early-init.el"
  (setq gc-cons-threshold most-positive-fixnum
        gc-cons-percentage 0.6)
#+end_src
*** avoid startup flash
#+begin_src emacs-lisp :tangle "early-init.el"
  (defun emacs-solo/avoid-initial-flash-of-light ()
    "Avoid flash of light when starting Emacs."
    (setq mode-line-format nil))
  (emacs-solo/avoid-initial-flash-of-light)
#+end_src
*** better Window Management handling
Resizing the Emacs frame can be a terribly expensive part of changing the font.
By inhibiting this, we easily halve startup times with fonts that are larger
than the system default.
#+begin_src emacs-lisp :tangle "early-init.el"
  (setq frame-resize-pixelwise t
        frame-inhibit-implied-resize t
        frame-title-format '("Emacs"))

  (setq inhibit-compacting-font-caches t)
#+end_src
*** disables unused UI Elements
#+begin_src emacs-lisp :tangle "early-init.el"
  (menu-bar-mode -1)
  (scroll-bar-mode -1)
  (tool-bar-mode -1)
  (tooltip-mode -1)
#+end_src
*** add custom directories to load-path
#+begin_src emacs-lisp :tangle "early-init.el"
  ;; Add the folder of my cust lisp files and modules to the load-path
  (mapc (lambda (string)
          (add-to-list 'load-path (concat user-emacs-directory string)))
        '("lm-lisp" "lm-modules" "lm-languages"))
#+end_src
*** provide early-init
#+begin_src emacs-lisp :tangle "early-init.el"
  (provide 'early-init) 
#+end_src
** Init
*** start of the file
#+begin_src emacs-lisp :tangle "init.el"
  ;; -*- lexical-binding: t -*-
#+end_src

*** emacs configuration
#+begin_src emacs-lisp :tangle "init.el"
  (use-package emacs
    :bind
    (("C-x C-b" . 'ibuffer)
     ; ("C-z" . nil)
     ("C-x C-z" . nil))
    :custom
    ;; EDITING
    (indent-tabs-mode nil) ; use spaces instead of tabs for indenting
    (delete-selection-mode 1)
    (set-mark-command-repeat-pop t) ; So we can use C-u C-SPC C-SPC C-SPC... instead of C-u C-SPC C-u C-SPC...

    ;; USER INTERACTION
    (read-answer-short t)
    (use-short-answers t)
    (visible-bell nil)
    (ring-bell-function 'ignore)
    (inhibit-startup-message t)
    (initial-scratch-message "")

    ;; TAB
    (tab-always-indent 'complete)
    (tab-width 4)

    ;; COMPLETION
    (completion-ignore-case t)
    (completions-detailed t)
    (completions-max-height 20)
    (completion-styles '(partial-completion flex initials))
    (completions-format 'vertical)
    (completion-show-help t)
    (global-completion-preview-mode 1)

    ;; MODELINE
    (column-number-mode 1)

    ;; TAB BAR
    (tab-bar-close-button-show nil)
    (tab-bar-new-button-show nil)
    (tab-bar-tab-hints t)
    
    ;; WINDOW BEHAVIUOR
    (window-resize-pixelwise nil)    
    (help-window-select t)
    (split-width-threshold 170)     ; So vertical splits are preferred
    (split-height-threshold nil)

    ;; HISTORY AND BACKUP FILES
    (recentf-max-saved-items 300) ; default is 20
    (recentf-max-menu-items 15)
    (history-length 300)
    (history-delete-duplicates t)
    (create-lockfiles nil)   ; No backup files
    (make-backup-files nil)  ; No backup files
    (backup-inhibited t)     ; No backup files
    (remote-file-name-inhibit-auto-save t)
    (save-place-file (expand-file-name "saveplace" user-emacs-directory))
    (save-place-limit 600)
    (savehist-autosave-interval 600)
    (savehist-additional-variables
     '(kill-ring                        ; clipboard
       register-alist                   ; macros
       mark-ring global-mark-ring       ; marks
       search-ring regexp-search-ring))
    
    ;; FILE REVERTING
    (auto-revert-interval 3)
    (auto-revert-remote-files nil)
    (auto-revert-use-notify t)
    (auto-revert-avoid-polling nil)
    (auto-revert-verbose t)

    ;; ISPELL
    (ispell-dictionary "en_US")

    ;; KILL AND DELETE
    (kill-do-not-save-duplicates t)
    (delete-by-moving-to-trash t)
    (remote-file-name-inhibit-delete-by-moving-to-trash t)

    ;; SYMLINK MANAGEMENT
    (find-file-visit-truename t)
    (vc-follow-symlinks t)
    
    ;; GREP
    (xref-search-program 'ripgrep)
    (grep-command "rg -nS --no-heading ")
    (grep-find-ignored-directories '(".git" "build"))
    
    :config
    ;; IN-TERMINAL BEHAVIOUR
    (unless (display-graphic-p)
  	(progn
  	  (xterm-mouse-mode)
  	  ;; Changes the vertical separator to a full vertical line
  	  ;; and truncation symbol to a right arrow
  	  (set-display-table-slot standard-display-table 'truncation ?\u2192)
  	  (set-display-table-slot standard-display-table 'vertical-border (make-glyph-code ?│))
  	  (setq x-select-enable-clipboard t
  			x-select-enable-primary t
  			x-select-request-type '(UTF8_STRING COMPOUND_TEXT TEXT STRING)
  			x-stretch-cursor t)))
    
    ;; Makes everything accept utf-8 as default, so buffers with tsx and so
    ;; won't ask for encoding (because undecided-unix) every single keystroke
    (modify-coding-system-alist 'file "" 'utf-8)

    ;; Set line-number-mode with relative numbering
    (setq display-line-numbers-type 'relative)
    (add-hook 'prog-mode-hook #'display-line-numbers-mode)

    ;; Add option "d" to whenever using C-x s or C-x C-c, allowing a quick preview
    ;; of the diff of what you're asked to save.
    (add-to-list 'save-some-buffers-action-alist
                 (list "d"
  					 (lambda (buffer) (diff-buffer-with-file (buffer-file-name buffer)))
  					 "show diff between the buffer and its file"))

    ;; Runs 'post-init.el' after Emacs inits
    (add-hook 'after-init-hook
  			(lambda ()
                (let ((private-file (expand-file-name "post-init.el" user-emacs-directory)))
  				(when (file-exists-p private-file)
                    (load private-file)))))

    ;; Save manual customizations to other file than init.el
    (setq custom-file (locate-user-emacs-file "custom-vars.el"))
    (load custom-file 'noerror 'nomessage)

    :init
    (repeat-mode 1)
    (savehist-mode 1)
    (save-place-mode 1)
    (global-auto-revert-mode t)
    
    (with-current-buffer (get-buffer-create "*scratch*")
      (insert (format
  			 ";;   Loading time : %s
  ;;   Packages     : %s
  ;;
  "
               (emacs-init-time)
               (number-to-string (length package-activated-list))))))
#+end_src
*** use-package configuration
#+begin_src emacs-lisp :tangle "init.el"
  (use-package use-package
    :init
    (setq package-install-upgrade-built-in t)
    (setq package-enable-at-startup nil)
    (setq package-quickstart nil)
    (setq use-package-always-ensure nil)
    (setq use-package-compute-statistics t)
    (setq package-archives '(("melpa" . "https://melpa.org/packages/")
                             ("melpa-stable" . "https://stable.melpa.org/packages/")
                             ("gnu" . "https://elpa.gnu.org/packages/")
                             ("elpa" . "https://elpa.gnu.org/packages/")
                             ("elpa-devel" . "https://elpa.gnu.org/devel/")
                             ("nongnu" . "https://elpa.nongnu.org/nongnu/")))

    (customize-set-variable 'package-archive-priorities '(("elpa" . 100)
  														("elpa-devel" . 101)
  														("gnu"    . 99)
  														("nongnu" . 80)
  														("stable" . 70)
  														("melpa"  . 0))))
#+end_src
*** dired configuration
#+begin_src emacs-lisp :tangle "init.el"
  (use-package dired
    :defer t
    :config
    (put 'dired-find-alternate-file 'disabled nil)
    :custom ((dired-listing-switches "-agho --group-directories-first")
  		   (dired-dwin-target t)))
#+end_src
*** ibuffer configuration
#+begin_src emacs-lisp :tangle "init.el"
  (use-package ibuffer
    :hook (ibuffer-mode . (lambda () (ibuffer-switch-to-saved-filter-groups "default")))
    :defer t
    :custom ((ibuffer-saved-filter-groups
  			'(("default"
  			   ("org" (or
  					   (mode . org-mode)
  					   (name . "^\\*Org Src")
  					   (name . "^\\*Org Agenda\\*$")))
  			   ("tramp" (name . "^\\*tramp.*"))
  			   ("terminal" (or
  							(mode . term-mode)
  							(mode . shell-mode)
  							(mode . eshell-mode)))
  			   ("ediff" (or
  						 (name . "^\\*ediff.*")
  						 (name . "^\\*Ediff.*")))
  			   ("dired" (mode . dired-mode))
  			   ("help" (or
  						(name . "^\\*Help\\*$")
  						(name . "^\\*info\\*$")
  						(name . "^\\*helpful")))
  			   ("emacs" (or
  						 (name . "^\\*scratch\\*$")
  						 (name . "^\\*Messages\\*$")
  						 (name . "^\\*Warnings\\*$")
  						 (name . "^\\*Shell Command Output\\*$")
  						 (name . "^\\*Async-native-compile-log\\*$")
  						 (name . "^\\*straight-")
  			 (name . "^\\*"))))))
  		   (ibuffer-show-empty-filter-groups nil)))
#+end_src
*** eshell configuration
#+begin_src emacs-lisp :tangle "init.el"
  (use-package eshell
    :defer t
    :config
    (add-hook 'eshell-mode-hook
  			(lambda ()
                (local-set-key (kbd "C-l")
  							 (lambda ()
                                 (interactive)
                                 (eshell/clear 1)
                                 (eshell-send-input)))))

    (add-hook 'eshell-mode-hook (lambda () (setenv "TERM" "xterm-256color")))
    (add-to-list 'eshell-modules-list 'eshell-tramp)
    (setq eshell-prefer-lisp-functions t)
    (setq eshell-prefer-lisp-variables t)
    (setq eshell-hist-ignoredups 'erase)
    (setq eshell-visual-commands
  		'("vi" "screen" "top"  "htop" "btm" "less" "more" "nvim" "vim")))
#+end_src
*** eglot configuration
#+begin_src emacs-lisp :tangle "init.el"
  (use-package eglot
    :defer t
    :custom
    (eglot-autoshutdown t)
    (eglot-events-buffer-size 0)
    (eglot-events-buffer-config '(:size 0 :format full))
    (eglot-prefer-plaintext t)
    (jsonrpc-event-hook nil)
    (eglot-code-action-indications nil)
    :init
    (fset #'jsonrpc--log-event #'ignore)

    :bind (:map
  		 eglot-mode-map
  		 ("C-c l a" . eglot-code-actions)
  		 ("C-c l o" . eglot-code-actions-organize-imports)
  		 ("C-c l r" . eglot-rename)
  		 ("C-c l f" . eglot-format)))
#+end_src
